#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Snow-Git-Terr/gh-actions-demo/runs/run-sSL64AhPLStrSTT6

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
snowflake_database.demo_db: Refreshing state... [id=DEV1]
snowflake_schema.demo_schema: Refreshing state... [id="DEV1"."DEV1_Schema_2"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # snowflake_database.demo_db will be updated in-place
  ~ resource "snowflake_database" "demo_db" {
      ~ fully_qualified_name                          = "\"DEV1\"" -> (known after apply)
        id                                            = "DEV1"
      ~ name                                          = "DEV1" -> "DEV2"
        # (18 unchanged attributes hidden)
    }

  # snowflake_schema.demo_schema must be replaced
-/+ resource "snowflake_schema" "demo_schema" {
      + catalog                                       = (known after apply)
      - comment                                       = "Schema for Snowflake Terraform demo" -> null
      ~ data_retention_time_in_days                   = 1 -> (known after apply)
      ~ database                                      = "DEV1" -> "DEV2" # forces replacement
      + default_ddl_collation                         = (known after apply)
      ~ describe_output                               = [] -> (known after apply)
      ~ enable_console_output                         = false -> (known after apply)
      + external_volume                               = (known after apply)
      ~ fully_qualified_name                          = "\"DEV1\".\"DEV1_Schema_2\"" -> (known after apply)
      ~ id                                            = "\"DEV1\".\"DEV1_Schema_2\"" -> (known after apply)
      ~ log_level                                     = "OFF" -> (known after apply)
      ~ max_data_extension_time_in_days               = 14 -> (known after apply)
      ~ name                                          = "DEV1_Schema_2" -> "DEV1_Schema_PR"
      ~ parameters                                    = [
          - {
              - catalog                                       = [
                  - {
                      - description = "Name of the catalog integration to use for iceberg tables"
                      - key         = "CATALOG"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - data_retention_time_in_days                   = [
                  - {
                      - default     = "1"
                      - description = "number of days to retain the old version of deleted/updated data"
                      - key         = "DATA_RETENTION_TIME_IN_DAYS"
                      - value       = "1"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - default_ddl_collation                         = [
                  - {
                      - description = "Collation that is used for all the new columns created by the DDL statements (if not specified)"
                      - key         = "DEFAULT_DDL_COLLATION"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - enable_console_output                         = [
                  - {
                      - default     = "false"
                      - description = "Enable stdout/stderr fast path logging for anonyous stored procs. This is a public parameter (similar to LOG_LEVEL)."
                      - key         = "ENABLE_CONSOLE_OUTPUT"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - external_volume                               = [
                  - {
                      - description = "Name of an external volume that will be used for persisted Iceberg metadata and data files."
                      - key         = "EXTERNAL_VOLUME"
                        # (3 unchanged attributes hidden)
                    },
                ]
              - log_level                                     = [
                  - {
                      - default     = "OFF"
                      - description = "LOG_LEVEL to use when filtering events"
                      - key         = "LOG_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - max_data_extension_time_in_days               = [
                  - {
                      - default     = "14"
                      - description = "Maximum number of days to extend data retention beyond the retention period to prevent a stream becoming stale."
                      - key         = "MAX_DATA_EXTENSION_TIME_IN_DAYS"
                      - value       = "14"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - pipe_execution_paused                         = [
                  - {
                      - default     = "false"
                      - description = "Pause processing of files for a pipe"
                      - key         = "PIPE_EXECUTION_PAUSED"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - quoted_identifiers_ignore_case                = [
                  - {
                      - default     = "false"
                      - description = "If true, the case of quoted identifiers is ignored"
                      - key         = "QUOTED_IDENTIFIERS_IGNORE_CASE"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - replace_invalid_characters                    = [
                  - {
                      - default     = "false"
                      - description = "Replace invalid UTF-8 characters found in Iceberg table external data files with the Unicode replacement character"
                      - key         = "REPLACE_INVALID_CHARACTERS"
                      - value       = "false"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - storage_serialization_policy                  = [
                  - {
                      - default     = "OPTIMIZED"
                      - description = "Storage serialization policy used for managed Iceberg table. This include encodings and compressions"
                      - key         = "STORAGE_SERIALIZATION_POLICY"
                      - value       = "OPTIMIZED"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - suspend_task_after_num_failures               = [
                  - {
                      - default     = "10"
                      - description = "How many times a task must fail in a row before it is automatically suspended. 0 disables auto-suspending."
                      - key         = "SUSPEND_TASK_AFTER_NUM_FAILURES"
                      - value       = "10"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - task_auto_retry_attempts                      = [
                  - {
                      - default     = "0"
                      - description = "Maximum Automatic Retries Allowed For A User Task"
                      - key         = "TASK_AUTO_RETRY_ATTEMPTS"
                      - value       = "0"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - trace_level                                   = [
                  - {
                      - default     = "OFF"
                      - description = "Trace level value to use when generating/filtering trace events"
                      - key         = "TRACE_LEVEL"
                      - value       = "OFF"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_managed_initial_warehouse_size      = [
                  - {
                      - default     = "Medium"
                      - description = "The initial size of warehouse to use for managed warehouses in the absence of history"
                      - key         = "USER_TASK_MANAGED_INITIAL_WAREHOUSE_SIZE"
                      - value       = "Medium"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_minimum_trigger_interval_in_seconds = [
                  - {
                      - default     = "30"
                      - description = "Minimum amount of time between Triggered Task executions in seconds"
                      - key         = "USER_TASK_MINIMUM_TRIGGER_INTERVAL_IN_SECONDS"
                      - value       = "30"
                        # (1 unchanged attribute hidden)
                    },
                ]
              - user_task_timeout_ms                          = [
                  - {
                      - default     = "3600000"
                      - description = "User task execution timeout in milliseconds"
                      - key         = "USER_TASK_TIMEOUT_MS"
                      - value       = "3600000"
                        # (1 unchanged attribute hidden)
                    },
                ]
            },
        ] -> (known after apply)
      ~ pipe_execution_paused                         = false -> (known after apply)
      ~ quoted_identifiers_ignore_case                = false -> (known after apply)
      ~ replace_invalid_characters                    = false -> (known after apply)
      ~ show_output                                   = [
          - {
              - comment         = "Schema for Snowflake Terraform demo"
              - created_on      = "2025-03-31 06:25:00.402 -0700 PDT"
              - database_name   = "DEV1"
              - dropped_on      = "0001-01-01 00:00:00 +0000 UTC"
              - is_current      = false
              - is_default      = false
              - name            = "DEV1_Schema_2"
              - owner           = "ACCOUNTADMIN"
              - owner_role_type = "ROLE"
              - retention_time  = "1"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ storage_serialization_policy                  = "OPTIMIZED" -> (known after apply)
      ~ suspend_task_after_num_failures               = 10 -> (known after apply)
      ~ task_auto_retry_attempts                      = 0 -> (known after apply)
      ~ trace_level                                   = "OFF" -> (known after apply)
      ~ user_task_managed_initial_warehouse_size      = "Medium" -> (known after apply)
      ~ user_task_minimum_trigger_interval_in_seconds = 30 -> (known after apply)
      ~ user_task_timeout_ms                          = 3600000 -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # snowflake_table.demo_table will be created
  + resource "snowflake_table" "demo_table" {
      + change_tracking             = false
      + comment                     = "Table created for Terraform Demo"
      + data_retention_time_in_days = -1
      + database                    = "DEV2"
      + fully_qualified_name        = (known after apply)
      + id                          = (known after apply)
      + name                        = "TB_PIPELINE_METADATA"
      + owner                       = (known after apply)
      + schema                      = "DEV1_Schema_PR"

      + column {
          + name                    = "PIPELINE_ID_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "int"
        }
      + column {
          + name                    = "LOB"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_DATABASE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_SCHEMA_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_STAGE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_FILEFORMAT_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_RELATIVE_FILE_PATH_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_FILE_REGEX_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_FILE_TYPE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "SOURCE_SCHEMATA_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "LANDING_DATABASE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "LANDING_SCHEMA_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "LANDING_TABLE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "TARGET_DATABASE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "TARGET_SCHEMA_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "TARGET_TABLE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "LOAD_TYPE_1"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "LOAD_STATUS"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "INS_TMESTMP"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
      + column {
          + name                    = "COMMENTS"
          + nullable                = true
          + schema_evolution_record = (known after apply)
          + type                    = "text"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.


```

</details>

*Pusher: @Alexeibeuno, Action: `pull_request`, Working Directory: ``, Workflow: `Snowflake Terraform Demo Workflow`*